rule impacket_secretsdump_sysmon_behavior {
  meta:
    author = "Author"
    description = "This Action demonstrates the use of IMPACKET to dump credential hashes from the Security Account Manager (SAM). In this Action, an attacker makes a copy of the SAM registry hive which contains user passwords stored in a hashed format. IMPACKET.SECRETSDUMP is then utilized to decrypt and dump the hashes from the registry hives. This behavior mimics utility toolsets such as IMPACKET and the accompanying module Secretsdump used by various threat actors once a machine has been compromised."
    severity = "HIGH"
    url = "https://attack.mitre.org/techniques/T1003/001/"
    tactic = "Credential Access"
    technique = "T1003.001"

  events:
    $e.metadata.event_type = "PROCESS_LAUNCH"
    re.regex($e.target.process.file.full_path, `\\reg\.exe$`)
    re.regex($e.target.process.command_line, `save hklm\\security C:\\Users\\Public\\Documents\\security\.save`) nocase
    (
      $e.target.asset.platform_software.platform = "WINDOWS" OR
      $e.target.platform = "WINDOWS"
    )

  outcome:
    $file_path = $e.target.process.file.full_path
    $command_line = $e.target.process.command_line
    $hostname = $e.principal.hostname
    $user = $e.principal.user.userid
    $pid = $e.principal.process.pid
    $parent_process = $e.principal.process.parent_process.file.full_path

  condition:
    $e
}
